import React, {useEffect, useRef} from "react"
import * as styles from "./index.module.scss"
import "./index.scss"
import { Helmet } from "react-helmet"
import { Link } from "gatsby"
import scrollTo from 'gatsby-plugin-smoothscroll';

const LpPage = ({ location }) => {

  const addScript = url => {
    const script = document.createElement("script")
    script.src = url
    script.async = true
    document.body.appendChild(script)
  }

  useEffect(() => {
    // addScript("https://code.jquery.com/jquery-3.4.1.min.js")
    // addScript("https://cdnjs.cloudflare.com/ajax/libs/vivus/0.4.4/vivus.min.js")
    // addScript("https://coco-factory.jp/ugokuweb/wp-content/themes/ugokuweb/data/4-1-5/js/4-1-5.js")
  },[]);

  const targets = useRef([])
  const ref1 = useRef()
  const ref2 = useRef()
  const ref3 = useRef()
  const ref4 = useRef()
  const ref5 = useRef()
  const addToTargets = (el) => {
    if (el && !targets.current?.includes(el)) {
      targets.current.push(el)
    }
  }


  const options = {
    rootMargin: "-50% 0px",
    threshold: 0
  };

  useEffect(() => {
    targets.current.forEach((target) => {
      const observer = new IntersectionObserver((entries) => {
        entries.forEach((entry) => {
          if (entry.isIntersecting) {
            entry.target.classList.add('is-active')
            if(entry.target.dataset.num === '1'){
              ref1.current.classList.add('is-current');
            }else if(entry.target.dataset.num === '2'){
              ref2.current.classList.add('is-current');
            }
            // console.log(entry.target.dataset.num);
          } else {
            entry.target.classList.remove('is-active')
          }
        })
      }, options)
      observer.observe(target)
    })
  }, [targets])


  return (
    <>
      <Helmet>
        <html lang="ja" />
        {/* --------------------------------------- mal様修正範囲(meta情報) 開始 --------------------------------------- */}
        <title>BLUE HUNTER アートコンペティション 公式サイト</title>
        <meta
          name="description"
          content="海の未発見生物を発見するミッションに挑む壮大なファンタジー「BLUEHUNTER」から、マンガの新章を記念して、全世界でアートコンペを開催します。皆さまからのたくさんのアイディアをお待ちしております！"
        />
        <meta name="keywords" content="BLUE HUNTER, ブルーハンター, ブルーハンタープロジェクト, 無料漫画, アートコンペ " />
        <link rel="canonical" href="https://manga.uminohi.jp/art/" />
        <meta property="og:url" content="https://manga.uminohi.jp/art/" />
        {/* --------------------------------------- mal様修正範囲(meta情報) 終了 --------------------------------------- */}
        <meta property="og:type" content="article" />
        <meta property="og:site_name" content="「BLUE HUNTER」アートコンペ公式サイト" />
        <meta property="og:image" content="https://manga.uminohi.jp/art/ogp_art.png" />
      </Helmet>

      {/* --------------------------------------- mal様修正範囲 開始 --------------------------------------- */}

      <div className={styles.bgVideoWrap}>
        <video className={styles.bgVideo} src="/lp/lp_bg.mov" loop autoPlay muted></video>
      </div>
      <div className={styles.fullPageScroll}>

        <section className={`${styles.section1} ${styles.section_about}`}>

          <div className={styles.mv}>
            <div className={styles.mv_logo}>
              <img src="/lp/mv_logo.svg" />
            </div>
            <div className={styles.mv_float}>
              <div className={styles.mv_lang}>
                <p className={styles.mv_langActive}>日本語</p>
                <span>|</span>
                <Link to="/en/art/" className={styles.mv_langInactive}>English</Link>
              </div>
              <div className={styles.mv_share}>
                <p className={styles.mv_share_txt}>Share:</p>
                <ul className={styles.mv_share_list}>
                  <li className={styles.mv_share_item}>
                    <a><img src="/lp/mv_twitter.svg" width="40" height="40" /></a>
                  </li>
                  <li className={styles.mv_share_item}>
                    <a><img src="/lp/mv_facebook.svg" width="40" height="40" /></a>
                  </li>
                </ul>
              </div>
            </div>

            <div className={styles.mv_scroll}>
              <img src="/lp/text_scroll.svg" />
            </div>


            {/* <div id="splash">
              <div id="splash_logo">
                <svg id="mask">
                  <path d="M1.34,11.36c2.24,.98,4.95,2.64,6.28,3.93l-1.44,2.04c-1.26-1.32-3.94-3.02-6.17-4.11l1.34-1.85Zm-.43,22.42c1.7-2.98,4.08-8.08,5.78-12.38l1.91,1.43c-1.55,4.04-3.68,8.76-5.23,11.63,.14,.23,.22,.42,.22,.6,0,.15-.04,.26-.11,.38l-2.56-1.66ZM7.87,7.32c-1.26-1.36-3.9-3.25-6.1-4.42l1.41-1.81c2.2,1.09,4.87,2.83,6.17,4.23l-1.48,2Zm25.74,14.61h-3.21c-.11,2.45-.22,4.49-.36,6.12h3.36v2.27h-3.57c-.65,5.29-1.88,5.44-5.34,5.44-.87,0-1.88,0-2.85-.08-.07-.64-.29-1.62-.65-2.19,1.99,.15,3.75,.15,4.58,.15,1.19,0,1.59-.98,1.91-3.32H13.75l-.29,1.89-2.31-.23c.43-2.64,.94-6.27,1.41-10.04h-3.75v-2.34h4.01c.32-2.79,.61-5.59,.79-8h15.89l1.3,.08c-.04,.23-.04,.57-.07,.79l-.22,7.13h3.1v2.34Zm-.22-14.04H14.87c-1.19,2.79-2.6,5.32-4.12,7.17-.43-.42-1.3-1.13-1.84-1.51,2.46-2.91,4.62-7.93,5.92-12.87l2.96,.83c-.07,.26-.32,.42-.79,.42-.36,1.21-.76,2.42-1.19,3.62h17.58v2.34Zm-13.79,20.16c.18-1.77,.36-3.89,.58-6.12h-5.38c-.25,2.15-.51,4.23-.76,6.12h5.56Zm.76-8.46c.14-1.96,.25-3.93,.36-5.74h-5.05c-.18,1.85-.4,3.77-.61,5.74h5.31Zm1.91,2.34c-.18,2.23-.36,4.38-.54,6.12h6.03c.14-1.59,.25-3.59,.36-6.12h-5.85Zm.58-8.08c-.14,1.81-.25,3.77-.4,5.74h5.78c.07-1.7,.11-3.62,.18-5.74h-5.56Z"/><path d="M37.4,11.36c2.38,.94,5.34,2.64,6.82,3.93l-1.37,2.11c-1.44-1.32-4.37-3.1-6.75-4.15l1.3-1.89Zm-.14,22.2c1.84-2.98,4.55-8.04,6.57-12.38l1.81,1.62c-1.81,4-4.22,8.76-5.96,11.7,.11,.19,.14,.38,.14,.53s-.04,.3-.11,.45l-2.46-1.93Zm7.36-26.24c-1.37-1.4-4.22-3.28-6.61-4.45l1.37-1.81c2.35,1.06,5.23,2.83,6.68,4.23l-1.44,2.04Zm25.06,17.06v2.42h-10.54v9.02h-2.46v-9.02h-10.25v-2.42h10.25v-5.96h-8.2v-2.38h8.2v-5.74h-9.31v-2.42h5.31c-.61-1.74-1.99-4.23-3.29-6.08l2.09-1.06c1.44,1.92,2.96,4.57,3.57,6.3l-1.55,.83h7.94l-1.12-.53c1.19-1.77,2.74-4.68,3.54-6.72l2.96,1.25c-.11,.26-.4,.34-.79,.34-.79,1.66-2.17,4-3.29,5.66h6.03v2.42h-9.64v5.74h8.52v2.38h-8.52v5.96h10.54Z"/><path d="M104.48,7.97c-.11,.19-.29,.3-.54,.38-3.36,5.36-9.03,10.99-14.59,15.18,2.78,2.34,5.56,5.25,7.4,7.36l-2.2,2c-3.79-4.64-10.9-10.87-17-14.61l1.73-1.93c2.56,1.51,5.45,3.51,8.05,5.59,4.87-3.62,9.82-8.49,12.67-12.87h-26.5v-2.57h28.41l.43-.23,2.13,1.7Z"/><path d="M110.87,4.83c3.75,1.25,8.09,3.21,10.76,5.13l-1.37,2.38c-2.6-1.92-6.86-3.93-10.54-5.25l1.16-2.27Zm-.14,26.16c12.82-4.15,21.34-11.67,25.67-22.12,.76,.64,1.59,1.13,2.35,1.55-4.51,10.34-13.32,18.38-25.56,22.65-.04,.34-.25,.72-.51,.87l-1.95-2.94Z"/><path d="M171.2,10.76c-.04,.15-.14,.34-.29,.45-.51,10.91-1.52,17.67-2.92,20.35-1.44,2.72-3.68,2.76-4.73,2.76-1.37,0-3.94-.34-6.43-.91,.04-.75-.04-1.89-.11-2.64,2.71,.6,5.49,.91,6.32,.91,1.3,0,2.02-.34,2.74-1.77,1.12-2.27,1.99-8.57,2.35-17.06h-11.52c-1.84,9.02-5.42,16.42-11.91,21.59-.47-.49-1.41-1.25-2.06-1.7,6.21-4.87,9.5-11.29,11.26-19.93h-9.96v-2.53h10.43c.43-2.64,.69-5.1,.87-8.27l3.57,.34c-.04,.38-.4,.6-.9,.68-.22,2.76-.43,4.87-.83,7.29h11.73l.54-.23,1.84,.68Zm-6.1-9.1c1.62,1.51,3.57,4.08,4.55,5.81l-1.44,1.06c-.9-1.59-2.96-4.34-4.48-5.85l1.37-1.02Zm5.63-1.66c1.59,1.59,3.61,4.08,4.58,5.78l-1.48,1.06c-.9-1.59-2.96-4.27-4.44-5.78l1.34-1.06Z"/><path d="M185.17,3.51c-.11,.42-.47,.64-1.19,.6-1.26,6.15-1.91,12.91-1.91,16.99,0,2.83,.11,5.7,.47,7.47,.69-1.85,2.24-5.81,2.74-7.13l1.52,1.66c-1.48,3.81-2.56,5.96-3.07,7.66-.18,.64-.29,1.25-.29,1.77,0,.42,.07,.79,.18,1.17l-2.56,.49c-1.16-3.59-1.59-7.96-1.59-12.99s.76-11.85,1.91-18.38l3.79,.68Zm23,27.6c-1.3,.08-2.64,.11-3.97,.11-2.56,0-4.98-.15-6.71-.42-4.44-.68-6.5-3.25-6.5-6.27,0-2.6,1.37-4.79,3.39-7.29l2.35,1.06c-1.81,1.96-3.07,3.77-3.07,5.93,0,4.38,6.14,4.38,9.89,4.38,1.52,0,3.14-.08,4.66-.19l-.04,2.68Zm-16.72-23.07c4.66-.11,10.94-.57,15.74-1.43l.22,2.64c-4.48,.79-11.73,1.28-15.89,1.4l-.07-2.6Z"/><path d="M239.4,32.39c-3.1-2.57-7.04-5.02-10.83-6.3,.07,1.47-.18,3.4-.47,4.38-.29,3.13-3.07,4.34-6.39,4.34-4.66,0-8.34-2.38-8.38-6.19-.07-3.81,3.75-6.15,8.3-6.19,1.26,0,2.89,.08,4.22,.34,0-1.02-.18-1.89-.22-2.76-.33-4.95-.61-12.87-.65-18.31l3.75,.23c0,.38-.33,.72-.94,.79-.04,1.02,0,6,0,7.13,2.35,0,7.62-.42,11.99-1.21l.25,2.68c-4.12,.68-9.46,1.06-12.2,1.09,0,2.15,.07,3.02,.61,10.83,4.66,1.43,9.06,4,12.6,6.72l-1.66,2.42Zm-17.83-7.7c-3.47,.08-5.88,1.59-5.88,3.74,0,2.76,2.85,3.96,5.74,3.96,2.53,0,4.62-.94,4.62-3.62,0-.87,0-2.42-.07-3.51-1.44-.45-3.03-.57-4.41-.57Z"/><path d="M254.96,17.29c2.38-1.28,6.1-2.19,8.95-2.19,5.74,0,9.35,3.51,9.35,9.06,0,6.83-5.74,10.61-13,10.61-4.69,0-7.91-1.96-7.91-5.29,0-2.79,2.64-5.06,5.92-5.06,4.08,0,6.82,3.4,7.37,6.83,2.89-1.13,4.98-3.55,4.98-7.06,0-4.08-2.89-6.68-7.44-6.68-5.42,0-10.72,2.53-13.11,4.95-1.08,1.06-2.49,2.64-3.47,3.81l-1.84-1.93c3.25-3.55,13.57-13.85,18.48-18.65-2.09,.3-9.31,.6-13.43,.75-.11,.26-.47,.49-.76,.57l-.29-3.21c4.87-.04,14.19-.42,16.82-.83l.54-.26,1.91,2.45c-.18,.15-.51,.3-.87,.34-2.56,2.19-9.42,8.91-12.24,11.74v.04Zm4.98,15.1c1.08,0,2.35-.15,3.29-.38-.4-2.91-2.46-5.36-5.13-5.36-1.88,0-3.54,1.06-3.54,2.79,0,2.3,3,2.94,5.38,2.94Z"/><path d="M1.34,56.65c2.24,.98,4.95,2.64,6.28,3.93l-1.44,2.04c-1.26-1.32-3.94-3.02-6.17-4.12l1.34-1.85Zm-.43,22.42c1.7-2.98,4.08-8.08,5.78-12.38l1.91,1.43c-1.55,4.04-3.68,8.76-5.23,11.63,.14,.23,.22,.42,.22,.6,0,.15-.04,.26-.11,.38l-2.56-1.66Zm6.97-26.46c-1.26-1.36-3.9-3.25-6.1-4.42l1.41-1.81c2.2,1.1,4.87,2.83,6.17,4.23l-1.48,2Zm25.74,14.61h-3.21c-.11,2.45-.22,4.49-.36,6.12h3.36v2.27h-3.57c-.65,5.29-1.88,5.44-5.34,5.44-.87,0-1.88,0-2.85-.08-.07-.64-.29-1.62-.65-2.19,1.99,.15,3.75,.15,4.58,.15,1.19,0,1.59-.98,1.91-3.32H13.75l-.29,1.89-2.31-.23c.43-2.64,.94-6.27,1.41-10.04h-3.75v-2.34h4.01c.32-2.79,.61-5.59,.79-8h15.89l1.3,.08c-.04,.23-.04,.57-.07,.79l-.22,7.13h3.1v2.34Zm-.22-14.04H14.87c-1.19,2.79-2.6,5.32-4.12,7.17-.43-.42-1.3-1.13-1.84-1.51,2.46-2.91,4.62-7.93,5.92-12.87l2.96,.83c-.07,.26-.32,.42-.79,.42-.36,1.21-.76,2.42-1.19,3.62h17.58v2.34Zm-13.79,20.16c.18-1.77,.36-3.89,.58-6.12h-5.38c-.25,2.15-.51,4.23-.76,6.12h5.56Zm.76-8.46c.14-1.96,.25-3.93,.36-5.74h-5.05c-.18,1.85-.4,3.77-.61,5.74h5.31Zm1.91,2.34c-.18,2.23-.36,4.38-.54,6.12h6.03c.14-1.58,.25-3.59,.36-6.12h-5.85Zm.58-8.08c-.14,1.81-.25,3.77-.4,5.74h5.78c.07-1.7,.11-3.62,.18-5.74h-5.56Z"/><path d="M55.02,52.88c-.14,.34-.43,.6-.9,.6-1.3,11.74-5.05,21.97-11.05,21.97-3.03,0-5.78-3.17-5.78-9.14,0-9.06,6.75-16.65,16.25-16.65,10.43,0,14.95,6.91,14.95,14.27,0,8.98-4.98,13.33-13.72,15.44-.33-.6-.94-1.62-1.52-2.3,8.3-1.66,12.56-5.89,12.56-13.02,0-6.23-3.83-11.89-12.27-11.89-.36,0-.76,.04-1.08,.08l2.56,.64Zm-3.47-.49c-7.29,.94-11.81,7.25-11.81,13.85,0,4.04,1.66,6.57,3.39,6.57,4.37,0,7.51-10.08,8.41-20.42Z"/><path d="M105.17,64.36h-13.32c3.39,4.98,9.06,9.85,14.19,12.23-.61,.53-1.37,1.51-1.81,2.19-5.02-2.61-10.4-7.55-14.01-12.8v15.1h-2.53v-14.8c-3.57,5.25-8.88,9.97-13.79,12.61-.43-.68-1.23-1.66-1.77-2.19,5.13-2.42,10.72-7.25,14.08-12.34h-13.18v-2.53h14.66v-6.95h-12.06v-2.49h12.06v-6.34l3.29,.19c-.04,.26-.25,.45-.76,.53v5.62h12.46v2.49h-12.46v6.95h14.95v2.53Z"/><path d="M141.38,65.45h-13.14c3.39,4.79,8.95,9.48,13.97,11.78-.58,.49-1.37,1.51-1.77,2.23-5.02-2.61-10.47-7.51-14.08-12.72v14.31h-2.53v-14.08c-3.61,5.13-8.95,9.78-13.9,12.34-.4-.64-1.16-1.62-1.77-2.15,5.02-2.27,10.51-6.91,13.9-11.7h-13.14v-2.42h14.91v-9.89h-13.14v-2.45h13.14v-4.68l3.25,.23c-.04,.26-.22,.45-.72,.53v3.93h13.47v2.45h-13.47v9.89h15.02v2.42Zm-24.22-2.91c-.51-2-1.95-5.13-3.39-7.44l2.13-.83c1.48,2.26,3.03,5.29,3.57,7.29l-2.31,.98Zm20.51-7.36c-.14,.23-.4,.34-.83,.34-.97,2.11-2.63,5.17-3.97,7.17,0-.04-2.06-.94-2.06-.94,1.3-2.04,2.96-5.4,3.86-7.74l3,1.17Z"/><path d="M165.93,61.3h11.73v2.15h-32.78v-2.15h11.41v-7.78h-9.31v-2.15h7.33c-.65-1.43-1.8-3.1-2.96-4.42l2.06-1.02c1.48,1.51,2.85,3.59,3.47,5.1l-.61,.34h9.64l-.54-.26c1.08-1.4,2.42-3.66,3.14-5.21l2.89,1.21c-.11,.23-.36,.3-.76,.3-.69,1.17-1.77,2.72-2.74,3.96h7.94v2.15h-9.89v7.78Zm-14.12-.26c-.43-1.74-1.66-4.23-3-6.04l2.02-.83c1.37,1.77,2.64,4.23,3.14,5.89l-2.17,.98Zm-1.16,20.05v-14.99h21.3v14.84h-2.46v-1.25h-16.5v1.4h-2.35Zm18.84-12.91h-16.5v3.66h16.5v-3.66Zm-16.5,9.4h16.5v-3.78h-16.5v3.78Zm5.56-24.05v7.78h5.05v-7.78h-5.05Zm15.67,1.58c-.14,.23-.36,.3-.76,.3-.9,1.66-2.42,4.08-3.61,5.66l-1.77-.87c1.16-1.66,2.64-4.38,3.47-6.27l2.67,1.17Z"/><path d="M211.02,57.26l1.66,.75c-.07,.19-.22,.34-.36,.42-1.59,6.57-4.62,11.51-8.52,15.21,2.96,2.26,6.53,3.96,10.76,5.02-.58,.53-1.3,1.62-1.7,2.34-4.4-1.21-8.09-3.09-11.16-5.59-3.39,2.64-7.37,4.49-11.55,5.7-.29-.68-.9-1.7-1.37-2.26,3.97-.98,7.76-2.64,11.05-5.13-3.83-3.74-6.53-8.61-8.56-14.5h-.04c-.51,6.72-2.38,14.5-9.06,21.1-.36-.64-1.23-1.62-1.77-2.08,7.98-7.85,8.52-17.4,8.52-24.35v-3.32h-6.57v-2.49h20.69l.54-.11,1.55,.45c-.04,.23-.14,.42-.22,.6-.43,2.08-1.19,5.25-1.95,8.34h7.58l.47-.11Zm-19.6-6.68v1.25c1.95,8.46,5.16,15.36,10.47,20.2,3.32-3.06,5.99-7.1,7.47-12.23h-7.04l-.54,2.04-2.46-.38c.9-3.32,1.99-7.7,2.67-10.87h-10.58Z"/><path d="M218.17,51.63h22.96l.22-.11,2.46,1.96c-.11,.15-.22,.26-.43,.34-2.92,14.19-9.21,21.59-20.25,25.97-.4-.68-1.12-1.66-1.62-2.23,10.51-4.04,16.57-11.06,18.92-23.33h-22.24v-2.6Zm27.51-6.76c2.17,0,3.94,1.85,3.94,4.15s-1.77,4.11-3.94,4.11-3.97-1.85-3.97-4.11c0-2.38,1.84-4.15,3.97-4.15Zm2.74,4.15c0-1.62-1.23-2.91-2.74-2.91s-2.78,1.28-2.78,2.91,1.26,2.91,2.78,2.91,2.74-1.4,2.74-2.91Z"/><path d="M279.51,52.24v24.92h-2.6v-2.38h-19.89v2.45h-2.53v-24.99h25.02Zm-2.6,20.01v-17.48h-19.89v17.48h19.89Z"/><path d="M287.49,58.05c3.25,.76,7.29,2.19,9.71,3.4l-1.08,2.38c-2.38-1.21-6.53-2.72-9.71-3.47l1.08-2.3Zm2.17,18.46c11.59-4.08,19.78-10.72,24.55-21.97,.54,.49,1.62,1.32,2.2,1.7-4.84,11.14-13.39,18.23-24.3,22.27,.11,.34-.11,.79-.4,.94l-2.06-2.95Zm1.81-27.82c3.25,.91,7.22,2.42,9.68,3.7l-1.19,2.3c-2.56-1.36-6.32-2.87-9.57-3.81l1.08-2.19Zm16.9-1.25c1.48,1.32,3.54,3.66,4.66,5.47l-1.41,1.09c-1.01-1.62-3.1-4.15-4.58-5.51l1.34-1.06Zm5.02-2.3c1.48,1.32,3.54,3.7,4.69,5.44l-1.41,1.09c-1.08-1.66-3.1-4.08-4.58-5.44l1.3-1.09Z"/><path d="M341.82,57.67v2.19h-8.88v14.84h10.9v2.19h-24.12v-2.19h10.9v-14.84h-8.81v-2.19h20Z"/>
                  <path d="M400.67,67.15c-3.68-2.08-8.74-4.53-12.67-6.15v18.88h-2.71V47.07l3.65,.23c-.04,.42-.33,.68-.94,.79v11.02l.54-.79c4.22,1.62,9.82,4.23,13.57,6.3l-1.44,2.53Z"/>
                </svg>
              </div>
            </div> */}

          </div>

          <div id="section1" data-num="1" ref={addToTargets} className={styles.sec1}>
            <p className={styles.lead_curtain_txt}>
              <span>海洋マンガによる海の未来普及プロジェクトとは？</span>
            </p>
            <h2 className={styles.lead_main_txt}>
              <img src="/lp/lead_about.svg" width="795" height="132" />
            </h2>
            <p className={styles.lead_txt}>全世界で100万人超が熱狂するWebtoon(縦読みマンガ)作品『BLUE HUNTER』を中心に”海洋の未来”をテーマにした物語・世界観を多言語、多メディアで全世界へ発信。世界観に共鳴する世界中のBLUE HUNTERファンから、アートコンペティションを通じて、現実の科学技術を牽引するような独創的な発想(空想)を集め、海洋の専門家を通じて、実際に海洋の未来技術に貢献します。発想(空想)の力で『BLUE HUNTER』の世界を拡張し人々の関心を高め、発想(空想)を具現化していく。より良い海洋未来を創るプロジェクトです。</p>
            <p className={styles.lead_attention}>※「海洋マンガによる海の未来普及プロジェクト」を推進する一般社団法人マンガ・アニメ・ゲーム教育創造機構は、日本財団「海と日本プロジェクト」の一環として、本活動を行っております。</p>
            <div className={styles.lead_logo}>
              <img src="/lp/lead_logo.svg" width="500" height="190"/>
            </div>
          </div>
        </section>

        <section id="section2" data-num="2" className={`${styles.section} ${styles.section2}`} ref={addToTargets}>
          <div className={`${styles.pcFlex} ${styles}`} >
            <div className={styles.sec_img_wrap}>
              <img src="/lp/area1_kv.jpg" />
            </div>
            <div className={styles.sec_cont_wrap}>
              <div className={styles.sec_cont_inner}>
                <h2>
                  <img src="/lp/area1_logo@2x.png" />
                </h2>
                <p className={styles.sec_text}>海洋科学が発達した世界で、女子高生・真夏が幻の海洋生物「シーザウルス」を求め、冒険に出る物語。“プロジェクトブルー” という世界プロジェクトによって、海洋生物の生態情報に対して仮想通貨「BLUE」が付与されるようになり、未知の海洋生物探索者は「ブルーハンター」と呼ばれる。真夏を中心に個性豊かなチームメンバーが集まり、さまざまな海を巡っていく海洋冒険ファンタジー。</p>
                <dl className={styles.sec_related}>
                  <dt><span>制作</span></dt>
                  <dd>WORLD EGGS、吉本アートファクトリー</dd>
                  <dt><span>キャスト</span></dt>
                  <dd>長江里加、井上麻里奈、上田瞳、高橋花林</dd>
                </dl>
                <div className={styles.sec_linkGroup}>
                  <a className={styles.sec_linkBtn}>公式サイトをみる</a>
                  <a>
                    <img src="/lp/icon_twitter.svg" />
                  </a>
                </div>
              </div>
            </div>
          </div>

        </section>
        <section id="section3" data-num="3" className={`${styles.section} ${styles.section3}`} ref={addToTargets}>
          <div className={`${styles.pcFlex} ${styles}`} >
            <div className={styles.sec_cont_wrap}>
              <div className={styles.sec_cont_inner}>
                <h2>
                  <img src="/lp/area2_logo.svg" />
                </h2>
                <p className={styles.sec_text}>昨年49カ国691件の応募があった『BLUE HUNTER Art Competition』をバージョンアップし、グローバルで第二弾を開催中。応募締め切りは2022年10月13日。「未来の海洋を表現する独創的な投稿作品」に対して、総額65万円の賞金が贈られます。今回はイラストのみではなく、3DCG作品の応募も受け付け”3DCG賞”を設けております。 12月にアワードイベントを開催し、受賞作品を表彰いたします。
                </p>
                <div className={styles.sec_linkGroup}>
                  <a className={styles.sec_linkBtn}>公式サイトをみる</a>
                  <a className={styles.sec_linkTwitter}>
                    <img src="/lp/icon_twitter.svg" />
                  </a>
                </div>
              </div>
            </div>
            <div className={styles.sec_img_wrap}>
              <img src="/lp/area2_kv.jpg" />
            </div>
          </div>
        </section>
        <section id="section4" data-num="4" className={`${styles.section} ${styles.section4}`} ref={addToTargets}>
          <div className={`${styles.pcFlex} ${styles}`} >
            <div className={styles.sec_img_wrap}>
              <img src="/lp/area3_kv.jpg" />
            </div>
            <div className={styles.sec_cont_wrap}>
              <div className={styles.sec_cont_inner}>
                <h2>
                  <img src="/lp/area3_logo@2x.png"/>
                </h2>
                <p className={styles.sec_text}>「まだ見たことのない海洋生物が、この広い海のどこかに存在しているんだ」未発見生物220万種を含む、地球上全ての海洋生物を発見するというミッションに挑み、世界中の人々の叡知を集結し、海の神秘と莫大な褒賞に挑む壮大なファンタジー。</p>
                <div>
                  <a className={styles.sec_linkBtn}>公式サイトをみる</a>
                </div>
              </div>
            </div>
          </div>

        </section>
        <section id="section5" data-num="5" className={`${styles.section} ${styles.section5}`} ref={addToTargets}>
          <div className={styles.sec5_cont}>
            <div className={styles.sec5_cont_top}>
              <p className={styles.sec5_text_img}>
                <img src="/lp/text_producedby.svg" alt="produced by"/>
              </p>
              <p className={styles.sec5_text}>一般社団法人マンガ・アニメ・ゲーム教育創造機構</p>
            </div>
            <div className={styles.sec5_logo_wrap}>
              <img src="/lp/lead_logo.svg" />
            </div>
          </div>
        </section>
      </div>
      <nav id="pagination" className={styles.pagination}>
        <button onClick={() => scrollTo('#section1')} ref={ref1}>My link1</button>
        <button onClick={() => scrollTo('#section2')} ref={ref2}>My link2</button>
        <button onClick={() => scrollTo('#section3')} ref={ref3}>My link3</button>
        <button onClick={() => scrollTo('#section4')} ref={ref4}>My link4</button>
        <button onClick={() => scrollTo('#section5')} ref={ref5}>My link5</button>
      </nav>
    </>
  )
}

export default LpPage
